exports.seed = function (knex) {
  return Promise.all([
    knex("users").insert([
      {
        name: "赵倩",
        phone: "13511111111",
        password: "mm111111",
        create_time: "2024-01-15 23:33:55",
      },
      {
        name: "季梦梦",
        phone: "13522222222",
        password: "mm222222",
        create_time: "2024-01-15 23:34:04",
      },
      {
        name: "孙立",
        phone: "13533333333",
        password: "mm333333",
        create_time: "2024-01-15 23:34:11",
      },
      {
        name: "王晨晨",
        phone: "13544444444",
        password: "mm444444",
        create_time: "2024-01-15 23:34:17",
      },
      {
        name: "周武",
        phone: "13555555555",
        password: "mm555555",
        create_time: "2024-01-16 14:45:26",
      },
      {
        name: "曲筱筱",
        phone: "13566666666",
        password: "mm666666",
        create_time: "2024-01-16 22:12:55",
      },
      {
        name: "曲7",
        phone: "13566666666",
        password: "mm666666",
        create_time: "2024-01-16 22:12:56",
      },
      {
        name: "曲8",
        phone: "13566777777",
        password: "mm777777",
        create_time: "2024-01-16 22:12:57",
      },
      {
        name: "曲9",
        phone: "13566888888",
        password: "mm888888",
        create_time: "2024-01-16 22:12:58",
      },
      {
        name: "曲10",
        phone: "13566999999",
        password: "mm999999",
        create_time: "2024-01-16 22:12:59",
      },
      {
        name: "曲11",
        phone: "13566101010",
        password: "mm101010",
        create_time: "2024-01-16 22:13:01",
      },
      {
        name: "曲12",
        phone: "13566111111",
        password: "mm111111",
        create_time: "2024-01-17 22:12:55",
      },
      {
        name: "曲13",
        phone: "13566121212",
        password: "mm121212",
        create_time: "2024-01-17 22:13:55",
      },
      {
        name: "曲14",
        phone: "13566131313",
        password: "mm131313",
        create_time: "2024-01-17 22:14:55",
      },
      {
        name: "曲15",
        phone: "13566141414",
        password: "mm141414",
        create_time: "2024-01-17 22:15:55",
      },
      {
        name: "曲16",
        phone: "13566151515",
        password: "mm151515",
        create_time: "2024-01-18 22:10:55",
      },
      {
        name: "曲17",
        phone: "13566161616",
        password: "mm161616",
        create_time: "2024-01-18 22:11:55",
      },
      {
        name: "曲18",
        phone: "13566171717",
        password: "mm171717",
        create_time: "2024-01-18 22:12:55",
      },
      {
        name: "曲19",
        phone: "13566181818",
        password: "mm181818",
        create_time: "2024-01-18 22:13:55",
      },
      {
        name: "曲20",
        phone: "13566191919",
        password: "mm191919",
        create_time: "2024-01-18 22:14:55",
      },
      {
        name: "曲21",
        phone: "13566202020",
        password: "mm202020",
        create_time: "2024-01-18 22:15:01",
      },
      {
        name: "曲22",
        phone: "13566212121",
        password: "mm212121",
        create_time: "2024-01-18 22:19:02",
      },
      {
        name: "曲23",
        phone: "13566222222",
        password: "mm222222",
        create_time: "2024-01-18 22:19:03",
      },
      {
        name: "曲24",
        phone: "13566232323",
        password: "mm232323",
        create_time: "2024-01-18 22:19:21",
      },
      {
        name: "曲25",
        phone: "13566242424",
        password: "mm242424",
        create_time: "2024-01-18 22:19:22",
      },
      {
        name: "曲26",
        phone: "13566252525",
        password: "mm252525",
        create_time: "2024-01-18 22:19:23",
      },
      {
        name: "曲27",
        phone: "13566262626",
        password: "mm262626",
        create_time: "2024-01-18 22:19:24",
      },
      {
        name: "曲28",
        phone: "13566272727",
        password: "mm272727",
        create_time: "2024-01-18 22:19:30",
      },
      {
        name: "曲29",
        phone: "13566282828",
        password: "mm282828",
        create_time: "2024-01-18 22:19:31",
      },
      {
        name: "曲30",
        phone: "13566292929",
        password: "mm292929",
        create_time: "2024-01-18 22:19:32",
      },
      {
        name: "曲31",
        phone: "13566303030",
        password: "mm303030",
        create_time: "2024-01-18 22:19:33",
      },
      {
        name: "曲32",
        phone: "13566313131",
        password: "mm313131",
        create_time: "2024-01-18 22:19:34",
      },
      {
        name: "曲33",
        phone: "13566323232",
        password: "mm323232",
        create_time: "2024-01-18 22:19:40",
      },
      {
        name: "曲34",
        phone: "13566333333",
        password: "mm333333",
        create_time: "2024-01-18 22:19:41",
      },
      {
        name: "曲35",
        phone: "13566343434",
        password: "mm343434",
        create_time: "2024-01-18 22:19:42",
      },
      {
        name: "曲36",
        phone: "13566353535",
        password: "mm353535",
        create_time: "2024-01-18 22:19:43",
      },
      {
        name: "曲37",
        phone: "13566363636",
        password: "mm363636",
        create_time: "2024-01-18 22:19:44",
      },
      {
        name: "曲38",
        phone: "13566373737",
        password: "mm373737",
        create_time: "2024-01-18 22:19:45",
      },
      {
        name: "曲39",
        phone: "13566383838",
        password: "mm383838",
        create_time: "2024-01-18 22:19:46",
      },
      {
        name: "曲40",
        phone: "13566393939",
        password: "mm393939",
        create_time: "2024-01-18 22:19:47",
      },
      {
        name: "曲41",
        phone: "13566404040",
        password: "mm404040",
        create_time: "2024-01-18 22:19:48",
      },
      {
        name: "曲42",
        phone: "13566414141",
        password: "mm414141",
        create_time: "2024-01-18 22:19:49",
      },
      {
        name: "曲43",
        phone: "13566424242",
        password: "mm424242",
        create_time: "2024-01-18 22:19:50",
      },
      {
        name: "曲44",
        phone: "13566434343",
        password: "mm434343",
        create_time: "2024-01-18 22:19:51",
      },
      {
        name: "曲45",
        phone: "13566444444",
        password: "mm444444",
        create_time: "2024-01-18 22:19:52",
      },
      {
        name: "曲46",
        phone: "13566454545",
        password: "mm454545",
        create_time: "2024-01-18 22:19:53",
      },
      {
        name: "曲47",
        phone: "13566464646",
        password: "mm464646",
        create_time: "2024-01-18 22:19:54",
      },
    ]),

    knex("classifications").insert([
      { id: 1, name: "技术动态" },
      { id: 2, name: "极客新闻" },
      { id: 3, name: "通知公告" },
      { id: 4, name: "技术热点" },
    ]),

    knex("articles").insert([
      {
        id: 1,
        name: "保时捷押注，估值 60 亿美元，这家公司要让 AI 进入汽车行业",
        classify: "技术动态",
        content:`
        <p>Applied Intuition 利用人工智能和大型语言模型来「改变」车辆性能和运行状况｜来源：Getty Image</p>
        <img src="https://imgslim.geekpark.net/uploads/image/file/52/8e/528e267e36652a977d77f84ad2ea1782.png" alt="图片描述">
        <p>全球的自动驾驶公司，都不怎么好过。</p>
        <p>在美国，估值一度达到 300 亿美元的 Cruise 陷入泥潭，硅谷典范的 Waymo 迟迟不见盈利的希望。在国内，曾经高举 L4 大旗的公司，也纷纷加入到为车企服务 L2+自动驾驶的服务之中，赚点辛苦钱。</p>
        <p>不过，凡事总有例外。</p>
        <p>保时捷不久前领投了一家自动驾驶汽车软件公司——Applied Intuition。</p>
        <p>该公司主要为汽车制造商和其他公司，开发可用于研发自动驾驶解决方案的「仿真测试」软件，让客户可以反复测试车辆的软件和硬件，还能帮助他们管理自动驾驶的海量数据，从而缩短开发周期，并加快汽车的生产速度。</p>
        <p>事实上，除了保时捷，参与领投的还有 Lux Capital 的 Bilal Zuberi、著名投资人 Elad Gil。不仅如此，Andreessen Horowitz、Mary Meeker 的 Bond 基金，甚至 F1 赛车世界冠军 Nico Rosberg 也加入了本轮投资。可谓是集合了众多明星资本。</p>
        <p>这轮融资帮助 Applied Intuition 筹资 2.5 亿美元，使其估值达到 60 亿美元。</p>
        <p>那么，在这样恶劣的环境下，Applied Intuition 凭借什么技术，完成上亿美元的融资？这家公司到底什么来头？</p>
      `,
      },
      {
        id: 2,
        name: "Rust 深度实践案例",
        classify: "技术动态",
        content:
          "不重要的内容，不重要的内容，不重要的内容，不重要的内容，不重要的内容",
      },
      {
        id: 3,
        name: "Temu 已经挑起了拼多多的「大梁」",
        classify: "技术动态",
        content:
          "不重要的内容，不重要的内容，不重要的内容，不重要的内容，不重要的内容",
      },
      {
        id: 4,
        name: "对话 Soul App 张璐：「AI 会如何改变社交」",
        classify: "技术动态",
        content:
          "不重要的内容，不重要的内容，不重要的内容，不重要的内容，不重要的内容",
      },
      {
        id: 5,
        name: "TikTok 凭什么敢对 1.7 亿美国用户弹窗",
        classify: "技术动态",
        content:`相对于TikTok 过去几年面对美国政府打压的耐心解释和沟通，最近TikTok却做出了与以往风格大相径庭的的行动——美东时间 3 月 7 日，TikTok 在应用程序中向美国地区18岁以上用户弹窗推送通知，号召他们给所在地区的国会议员打电话，撤销针对 TikTok 的剥离法案。
        TikTok 在应用内开屏提示用户：现在是需要发声的时刻，「该（法案）将剥夺 1.7 亿美国人的宪法自由言论权，损害数以百万计的企业，摧毁全国各地无数创作者的生计，剥夺艺术家的观众」，「让国会知道 TikTok 对你意味着什么，并让他们投出反对票。」
        根据极客公园调查了解到的一些信息，TikTok 此举出自美国本土团队的决策，因为此次情况更为紧急，并已经退无可退。相比 2020 年时任总统特朗普签署行政令，要求字节跳动在 90 天内剥离 TikTok 在美国的业务，否则将面临禁令，这次的《保护美国人免受外国对手控制应用程序侵害法》（Protecting Americans from Foreign Adversary Controlled Applications Act）显得更为紧迫和直接。`,
      },
      {
        id: 6,
        name: "一夜大涨 389 亿元，不要低估京东的韧性",
        classify: "通知公告",
        content:`业绩、股价承压许久的京东，迎来了一份不错的年终成绩单。
        3 月 6 日，京东集团发布了 2023 年四季度及全年业绩。在收入方面，京东四季度收入增长 3.6% 至 3061 亿元（约 431 亿美元），超出分析师预期的 422 亿美元。全年收入 10847 亿元（约 1528 亿美元），同比增长 3.7%。
        在利润方面，京东四季度在非美国通用会计准则下归属于上市公司普通股股东的净利润为 84 亿元人民币（约 12 亿美元），全年利润达到 352 亿元人民币（约 50 亿美元），均超出市场预期。
        此外，京东还宣布了丰厚的股利分红和股份回购计划。董事会已批准派发年度现金股利 12 亿美元，超过了去年的 10 亿美元。同时，董事会也宣布截至 2027 年 3 月的未来 36 个月内，可能会回购价值高达 30 亿美元的股票（包括美国存托股份）。
        受业绩和分红回购计划的影响，截至收盘，京东大涨 16.18%，报 24.91 美元，市值 392.1 亿美元。其市值一夜飙涨 54 亿美元（约合人民币 389 亿元）。
        自 2021 年以来，在拼多多、抖音等低价电商的持续冲击之下，京东的基本面一度不被看好，市值较高点跌去了近 80%。而过去一年，意识到危机的京东创始人刘强东重回一线，开始猛推低价战略、调整组织架构和更换核心高管、多次内部讲话等等，试图让京东再次「伟大」。
        但在此之前，市场对刘强东的「回归」和京东策略的调整并不太买单。京东股价从年初的 60 美元左右一路下跌，就在财报发布前的 3 月 4 日，受达达谎报收入事件影响，京东股价日内再次下跌 5%，350 亿美元的市值甚至不到拼多多的 1/4。
        这样的估值，对于一个每年发生数万亿元的交易、可以创造几十亿美元利润的平台，以及一位能从 10 年前电商血海里杀出的创业者，显然是有点低估。
        Q：收入利润增长超预期，守住家电基本盘
        京东的收入结构包括产品收入和服务收入。四季度，京东收入 3061 亿元，其中产品收入达 2465 亿元、服务收入达 595 亿元，分别增长 3.7%、3%。
        其中，产品收入主要包括京东主营的电子和家用电器收入、一般商品收入。四季度，京东电子和家用电器收入增长明显，同比增长 6.1%，达到 1504 亿元。而一般商品基本持平，为 961 亿元。
        服务收入主要包括市场和营销收入、物流及其他服务收入。四季度，京东在实施了免佣降费等大力扶持中小商家运营的举措后，向商家收取的市场和营销收入增长放缓至 4%，达 236 亿元。而物流及其他服务收入则增长 8%，达 360 亿元。`,
      },
      {
        id: 7,
        name: "MWC2024，看看厂商的新产品能有多离谱！",
        classify: "通知公告",
        content:`在巴塞罗那举行的世界移动通信大会（Mobile World Congress,MWC）一直是向世界展示最新、最先进移动技术的地方。
        本次大会以 「VELOCITY」（速度） 为主题，全球各地的运营商、手机厂商与技术厂商积极参展，人工智能主导了大多数重大创新产品的发布，而大会的焦点则指向AI和智能手机的结合。
        不少智能手机制造商指出，设备上运行的人工智能提高了设备的安全性，解锁了新的应用程序，而且速度更快，因为数据处理是在手机上完成的。
        对此，CCS Insight首席分析师Ben Wood还表示，「我认为，在MWC上，一个大新闻将是AI大模型在设备本身上运行的能力，这一点将很有可能改变游戏规则。」
        除了手机，展品还包括笔记本电脑、智能手表、疯狂的概念产品，甚至还有机器狗。
        尽管许多产品让我们热血沸腾、瞠目结舌，但有些产品却更进一步，将技术提升到了一个新的水平，带来了新的创新功能。极客公园在这里挑选了 10 个非常有意思的产品。
        一、手机又要变形了,折叠概念手机
        在过去几年里，全球已经见证了可折叠手机的卷土重来。事实上，可折叠手机市场继续呈现出积极的增长态势，制造商预测 2024 年的销量会更高。
因此，摩托罗拉大胆推出了全球首款可弯曲手机。作为一款概念产品，摩托罗拉公布了显示技术的进展，这无疑是智能手机市场上的一枝独秀。
平放时，摩托罗拉的自适应显示屏概念手机看起来与普通手机无异，但它可以弯曲成各种尺寸，比如向后折叠，形成拱形，并卡在手腕上的磁性带子上，使其固定到位。
根据摩托罗拉公司代表的描述，「将使手机弯曲的机制描述为类似于人体脊柱的工作方式。」
三星公司也不甘示弱，展示了一款手机——手镯概念，它可以从外观普通的手机变为可戴在手腕上的弧形屏幕。`
      },
      {
        id: 8,
        name: "「美版知乎」沦为互联网垃圾桶，锅能甩给 ChatGPT 吗？",
        classify: "通知公告",
        content: `头图来源：Beautiful.AI
        作者｜Moonshot
        编辑｜靖宇
        诞生自 2009 年的 Quora 马上要 15 岁了，它是知乎的「师傅」，也曾是互联网上最好的搜索具体问题的平台。无论是「成为 XX 是什么体验？」还是「现代人会觉得古罗马的食物好吃吗？」在 Quora 上都可以找到来自世界各地，专业且主观的回答。
        Quora 问题涉猎之广，回答专业之精，社区氛围之好，都让横空出世于 2009 年 Quora，仍能在众多互联网内容平台里抢占独特的一席之地，Vox 曾称 Quora 是「更有条理的 Yahoo Answers，更古典的 Reddit，更主观地维基百科」。
        它曾被称之为互联网上的「亚历山大图书馆」。
        如今的互联网更是需要 Quora 这类平台，互联网信息的一端是维基百科里的无数条目，是 ChatGPT 类简明扼要地回答，是 Google 结果里的大海捞针，另一端是算法推荐下刷不完的短视频，滤镜矫饰后图文展现的美好生活，描述个人生活和观点的社交媒体，主观且难以检索。
        Quora 的目标曾是站在两端中间，站在客观的信息罗列和主观的个人呈现之间。就像「在上世纪飞上太空是什么体验」这个问题，只有宇航员本人能给予作答，它夹杂着科学的进程和情感的波动，还需要个人回忆的介入。
        而如今的 Quora 却像一个信息垃圾场，选择订阅每日摘要的用户们会收到各种莫名其妙的问题的推送，诸如「在别人家过夜不洗澡是不是很无礼？」「我收到匿名邮箱发来的 68 个比特币，我该报警吗？」「希特勒本人真的是好人吗？」「我丈夫出于愤怒，不小心把我们 4 岁的女儿从 40 楼的窗户上推了下来，如何防止我丈夫被判入狱？」点击和讨论量还非常高。
        选自每日 Quora 的邮件推送服务｜图片来源：X
        甚至还有 AI 直接生成个诸如「天呐！查尔斯国王对哈里王子的禁令震惊世界，你伤心吗？」这种莫名其妙的条目，再由 AI 机器人不知所云地回答一下。一唱一和就能收获 840 万浏览量和 2000 + 的点赞。
        在去年 ChatGPT 出现后，Quora 则直接在问题中附上了 ChatGPT 的回答，ChatGPT 不仅比人类回答者更靠前，答案也截然相反。`,
      },
      {
        id: 9,
        name: "民营商业航天完成「登月本垒打」，NASA 52年后「重回月球」",
        classify: "通知公告",
        content:`美国东部时间下午6点24分，「奥德修斯」号（Odysseus）在月球表面自主着陆，随后与任务控制中心建立了长达13分钟的无线电通信。此次着陆是自1972年阿波罗17号以来，美国首次发射月球着陆器任务，但更重要的是，这也是私营公司首次成功将着陆器完好地送上月球，可以说是载入史册的一天，开启了民营商业航天的新篇章。
        50多年前，美国在冷战的紧张氛围中，几乎是举国体制地推进了登月探索。如今，这一历史性的壮举却由民营力量完成。这次任务成功的背后，是SpaceX的「猎鹰9」火箭和 Intuitive Machines公司的「奥德修斯」着陆器。这两家公司的合作，展现了民营航天的实力。
        此次着陆是NASA（美国宇航局）「商业月球有效载荷服务」（CLPS）计划的一部分，旨在支持该机构的「阿尔忒弥斯」计划——将宇航员送回月球，甚至在那里建立一个永久基地。「奥德修斯」的成功着陆，是迈向这个目标的重要一步。
        登上月球从来不是简单的事情，在全球范围内，除了美国，只有苏联、中国、印度和日本的政府太空计划，成功地在月球表面进行过「软着陆」。直到现在，登陆月球依旧是失败率很高的事情。
        近期的其他尝试，如匹兹堡的Astrobotic Technology、日本的ispace公司的Hakuto-R任务、以色列的Beresheet着陆器以及俄罗斯的Luna 25，均以失败告终。
        虽然这次「奥德修斯」的任务不如当初的阿波罗任务一样宏伟，但NASA希望借此开启一个更具革命性的时代：引入民营商业航天力量一起参与，最终实现经济高效的太阳系交通。这一愿景预示着未来太空探索将更加频繁、成本更低，为人类在太空的活动开辟新的可能性。`,
      },
      {
        id: 10,
        name: "为训大模型不择手段的AI公司，打破了这个古老的互联网协议",
        classify: "通知公告",
        content:`大模型的横空出世，打破了 30 年来互联网的运行规则。
        代码版「互联网小宪法」robots.txt 开始失效了。robots.txt 是一个文本文件，每个网站都用它来说明自己是否愿意被爬虫抓取。30 年来，一直是它，让互联网不至于在混乱中运行。
        不过这个规则能长久运行其实纯靠一个人性逻辑——你让搜索引擎抓取你的网站，同时你会获得搜索引擎的流量回报。这也是几位互联网先驱者达成的握手协议，为了造福互联网上的所有人。
        这种既没有写入法律，也没有权威约束，稍显天真的规则在运行了 30 年后，终于出现了问题——越来越多的 AI 公司用爬虫抓取你的网站数据，提取数据集，训练大模型和相关产品，但他们并不像搜索引擎那样回馈以流量，甚至根本不承认有你存在，你的数据就像肉包子打狗一样有去无回。
        很多数据拥有者非常愤怒，新闻出版商等数据拥有者不断地发声，封锁 AI 爬虫，反抗自己的数字资产被无偿使用。不过如谷歌和 OpenAI 这样的 AI 推动者，也在试图找到更好的规则，毕竟只有各方获益才能持续发展。`,
      },
      {
        id: 11,
        name: "保时捷押注，估值 60 亿美元，这家公司要让 AI 进入汽车行业",
        classify: "极客新闻",
        content:`
        <p>Applied Intuition 利用人工智能和大型语言模型来「改变」车辆性能和运行状况｜来源：Getty Image</p>
        <img src="https://imgslim.geekpark.net/uploads/image/file/52/8e/528e267e36652a977d77f84ad2ea1782.png" alt="图片描述">
        <p>全球的自动驾驶公司，都不怎么好过。</p>
        <p>在美国，估值一度达到 300 亿美元的 Cruise 陷入泥潭，硅谷典范的 Waymo 迟迟不见盈利的希望。在国内，曾经高举 L4 大旗的公司，也纷纷加入到为车企服务 L2+自动驾驶的服务之中，赚点辛苦钱。</p>
        <p>不过，凡事总有例外。</p>
        <p>保时捷不久前领投了一家自动驾驶汽车软件公司——Applied Intuition。</p>
        <p>该公司主要为汽车制造商和其他公司，开发可用于研发自动驾驶解决方案的「仿真测试」软件，让客户可以反复测试车辆的软件和硬件，还能帮助他们管理自动驾驶的海量数据，从而缩短开发周期，并加快汽车的生产速度。</p>
        <p>事实上，除了保时捷，参与领投的还有 Lux Capital 的 Bilal Zuberi、著名投资人 Elad Gil。不仅如此，Andreessen Horowitz、Mary Meeker 的 Bond 基金，甚至 F1 赛车世界冠军 Nico Rosberg 也加入了本轮投资。可谓是集合了众多明星资本。</p>
        <p>这轮融资帮助 Applied Intuition 筹资 2.5 亿美元，使其估值达到 60 亿美元。</p>
        <p>那么，在这样恶劣的环境下，Applied Intuition 凭借什么技术，完成上亿美元的融资？这家公司到底什么来头？</p>
      `,
      },
      {
        id: 12,
        name: "从健身到泛运动，Keep 还有哪些野心?",
        classify: "极客新闻",
        content:`成立九年的 Keep，在上市后的第一年，正在进行一次全方位的改变。
        3 月 27 日，Keep 在北京举办主题为「处处皆主场」的 Keep 8.0 新版本发布会，同时宣布更新公司的使命愿景，进一步服务全民健身，激发全民运动。新版本 Keep 增加了球类、徒步、攀岩等多个运动品类，并开放了更多外部硬件的连接，完善数据记录与分析功能。同时社交功能也更加完备，升级了俱乐部、奖牌、达人课程等玩法。
        一天后，Keep 发布 2023 年第四季度和全年财报。其中最的亮点是亏损大幅缩窄 55.7% 至 2.95 亿元；同时毛利率从 2022 年的 40.7% 提高到 45%，增加了 4.3 个百分点。`,
      },
      {
        id: 13,
        name: "AI应用元年来了，谁帮创业者「开卷」",
        classify: "极客新闻",
        content:`大模型技术革命爆发一年多，对大众来说，大模型神秘的样子逐渐清晰，AI 创业也从兴奋期慢慢开始务实。

        当前 AI 技术创业周期已经进入应用层，甚至已经开始快速迭代。3 月 13 号，a16z 发布了 TOP50 AI 应用，和半年前相比，已换血一半。
        
        技术改变世界的过程，正是创业浪潮大浪淘金的过程。创业项目逐渐成熟的同时，暴露出更多问题，技术、成本、场景、商业化……每个环节都需要解决。
        
        技术创业进入应用落地阶段，创业者所需要的创新要素和资源一直在变化。阿里云伴随着时代周期，和创业者来到关卡，为时代浪潮提供助力。
        
        3 月 22 日，阿里云创业者计划「预见 2024：AI 创变者」Startup Day 专场活动在阿里云谷园区正式举办。阿里云创业孵化事业部总经理李中雨在现场分享了一个数据，阿里云创业者计划自去年 9 月发布以来，累计已支持超 10000 余家企业云上创新，直接为超过 3000 家中小企业提供最低 3500、最高 100 万的上云抵扣金支持。`,
      },
      {
        id: 14,
        name: "vivo X Fold3 Pro：极致之上，再进一步",
        classify: "极客新闻",
        content:`2024 年，既是属于智能手机的变革之年，也是折叠屏旗舰至关重要的突破之年。

        生成式 AI 对智能手机的冲击固然巨大，但对于折叠屏旗舰而言，则有着另一条同样重要的「暗线」，就是如何在折叠屏自身的硬件限制之下进一步突破，来挑战高端直板手机。如今的折叠屏手机相比普通直板手机的区别仍不明显，大屏的优势更多体现在应急场景之中。
        
        这让很多已经买了折叠屏手机的用户，反而是在绞尽脑汁地思考：折叠屏的优势到底在哪里，手机厂商也围绕着这个思维定式，刻意地设计了很多并不属于直板旗舰使用日常的使用场景。
        
        但 2023 年直板旗舰的发展趋势，已经从针对折叠屏使用的系统优化，进一步向计算摄影与 AI 能力倾斜。这既是时代大势所趋，但同时也对折叠屏旗舰是否「全能」提出了新的挑战——特别是对于一直以「全能折叠屏旗舰」定位示人的 vivo X Fold 系列。
        
        在 X100 系列大获成功之后，X Fold 系列想要继续稳固 2023 年在高端旗舰市场上的定位，一款更加优秀的折叠屏旗舰几乎是 vivo 不得不再次自我超越的一个命题。
        
        而 vivo X Fold3 Pro，就是 vivo 在 2024 年给出的回答。`,
      },
      {
        id: 15,
        name: "阿里为什么撤回菜鸟 IPO？",
        classify: "极客新闻",
        content:`在向港交所提交上市申请书 6 个月后——在资料过期的最后一天（3 月 26 日），阿里巴巴集团董事会还是决定，将撤回旗下物流集团菜鸟的港股 IPO 申请。

        「刚好截至今日（3 月 26 日），我们向香港交易所提交的（菜鸟）招股书财务资料就要过期了。因此我们必须要做出一个决定，是否继续 IPO 的申请。」在当晚的电话会上，阿里巴巴集团主席、菜鸟集团董事长蔡崇信表示。
        
        他说，集团最终的考虑是，「目前资本市场处在低迷状态，而且缺乏流动性，因此硬要去推进这样的资本市场交易是没有意义的。它无法达成为股东实现价值的目标。」
        
        至此，阿里提出近一年的子集团拆分上市计划，几乎全部遇挫。
        
        去年 3 月，阿里宣布了「1+6+N」史上最大组织变革，六大子集团将成立单独董事会，对各自的经营结果和合规性负责，除淘天集团外均可寻求单独上市。紧接着 5 月，阿里宣布了子集团的董事会名单、融资和上市计划。其中，阿里国际数字商业集团寻求对外融资，盒马、云智能集团、菜鸟先后实现上市，时间约 12 个月左右，而云智能集团将以股东派息的方式实现分拆、最终独立上市。
        
        然而，等到去年 11 月，阿里便宣布不再推进盒马、云智能集团的 IPO。原因均是市场不及预期。其中，云智能集团是「随着美国扩大出口管制规则、分拆可能无法实现股东增值的效果」，而盒马是「正在评估确保成功推进项目实施和提升股东价值所必须的市场状况和其他因素」。
        
        菜鸟是走得最远的，于去年 8 月就向香港交易所提交了上市申请书，然而现在还是撤回了。
        
        一年前，面对主营电商业务被拼多多、抖音等对手的持续侵蚀，阿里开启了大刀阔斧的内部组织变革。但一年过去，几个主要竞争对手——拼多多在 Temu 的推动下取得了 2021 年以来首次三位数的营收增长；抖音电商去年的 GMV 据传也已突破 2 万亿元，其中商城 GMV 同比增长 277%；即使同样增长艰难的京东，经过百亿补贴等一系列策略调整后，2023 年四季度核心 3C 产品的零售收入也增长了 6.1%。
        
        相较之下，精力被 IPO、架构调整等内部事宜分散的阿里，其核心中国零售业务去年四季度的收入只增长了 1%，连续两年几乎零增长。
        
        阿里表示，撤回菜鸟 IPO 的另一层原因是，将能帮助阿里更好地赢得国内、国际电商之战——「从集团的角度出发，我们的首要目标非常明确，那就是要在电商领域获胜。为此，我们需要恢复市场份额，推动业务增长。」蔡崇信表示，菜鸟应该专注于跟阿里电商业务深度融合、打赢电商之战，不应为 IPO 而分心。`,
      },
      {
        id: 16,
        name: "80 亿美元！Altman+腾讯做大股东，「美国贴吧」苦熬 19 年终上市",
        classify: "通知公告",
        content:`当地时间 3 月 21 日，有「美国贴吧」之称，创立 19 年的 Reddit 正式纽交所上市，它也成为今年首个登陆资本市场的大型科技公司。
        据招股书显示，Reddit 想以每股 31 美元至 34 美元的价格出售 2200 万股股票，IPO 可筹集至多 7.48 亿美元，Reddit 寻求 65 亿美元的总估值，然而在 3 月 21 日的上市当日，Reddit 最终收涨 48.4%，股价达到 50.44 美元，公司市值超 80 亿美元。
        鲜有人知的是，目前 Reddit 是美国第五大网站，流量仅次于 Google、YouTube、Facebook 以及 Amazon。招股书里显示，Reddit 有 3.3 亿月活跃用户，7310 万日活跃用户，10 万个活跃子社区。
        然而，Reddit 正式员工只有 2013 人，而且不同于其他科技互联网公司，Reddit 的办公室分散在旧金山和纽约和世界各地。甚至许多用户都多年来以志愿者的方式，参与着 Reddit 的建设。
        因此在这次 IPO 里，与其他公司不同，Reddit 给核心用户和版主、员工的亲朋好友们预留大约 176 万股股票，占发行总额 8%，要知道 Reddit 创始人兼 CEO Steve Huffman 的持股只有 3.3%。而且在 Reddit 上市后，这批总估值能达到 5.2 亿美元的股票不会受到禁售期（常规是 6 个月）的限制，也就是说这些用户可以在上市当天就把自己的股票卖掉。`,
      },
      {
        id: 17,
        name: "腾讯找到了自己的「小小元宇宙」",
        classify: "通知公告",
        content:`春节回老家肩负起了给亲戚带娃的任务，这两天陪刚上初中的表弟玩游戏，我玩了几天腾讯的《元梦之星》。
        这款游戏刚出的时候我就看到了，不过因为平常工作太忙，加上不是派对游戏的死忠，所以没在第一时间下载体验。不过对于这款游戏后续的进展我倒是一直有在关注：上线后持续位列免费榜前三（首月 28 天位于免费榜第一）、30 天超 8000 万注册用户、还有大家喜闻乐见的「猪鹅口水战」的八卦……
        虽然吃了瓜，但我也就当成是腾讯在派对游戏这个新热赛道的又一次下场。国内游戏大厂竞争看的多了，看起来这也就是当年吃鸡大战的翻版——此前派对游戏在国内不温不火，直到《糖豆人》通过 STEAM 在国内火了，这两年国内厂商也纷纷推出了同类游戏，比如网易的《蛋仔派对》、莉莉丝的《生活派对》、鹰角网络的《泡姆泡姆》、独立游戏工作室 Recreate Games 的《猛兽派对》等……腾讯不是第一个，当然也不会是最后一个。
        不过一些产业信号表明，腾讯做《元梦之星》并非仅仅为了追求短期的热门游戏收益，而是在背后有着对游戏+社交的探索性尝试。比如在运营上，腾讯并不太急于商业化，而是走了类似大 DAU 游戏的商业模式，通过销售皮肤和月卡等虚拟商品来实现收益。
        此外据电厂报道，在腾讯年会上，马化腾形容《元梦之星》不只是一款游戏，还有「偏社交」的成分，并称「这本身就是我们的大本营阵地，肯定要全力以赴，而且要求所有业务结合，探索共同发展。」
        玩了《元梦之星》之后，我有了更强烈的体感：今天大部分游戏都是通过给玩家带来竞技、数值成长、集卡等游戏性的要素爽点来吸引用户，而元梦里与朋友社交本身带来的情绪价值对用户有更大的吸引力。就像前几天我们几个同事在编辑部里一起下飞行棋，以及明后天要和亲戚朋友一起打麻将一样，这些轻竞技、重休闲、以用户交互为核心的游戏内容，反而更能成为感情连接的桥梁。
        一些小细节也能看出游戏的运营团队充分意识到了这点，包括春节期间推出的一些合家欢主题的运营活动，以及近日上线的 QQ/微信好友「扫码一起玩」功能，来方便玩家更快捷地拉上亲朋好友一起玩——都在表明这款游戏在尝试塑造一个新的社交场景，而不只是做一个让玩家到线上消遣的手游。
        这也引发了我更多的思考。最近几年，随着元宇宙、游戏化社交的兴起，公园关注了很多在这个领域探索尝试的企业，包括腾讯自身也曾在元宇宙等赛道有过诸多尝试。而《元梦之星》的推出，一定程度上是这家游戏+社交行业巨头，对这个问题给出的一个新的答案。`,
      },
      {
        id: 18,
        name: "字节高管调整：张楠辞任抖音集团 CEO，无新设 CEO 计划",
        classify: "通知公告",
        content:`抖音迎来了一次高管调整。2 月 7 日消息，抖音集团 CEO 张楠 Kelly 宣布自己已经辞去集团 CEO 一职，未来将把精力聚焦在剪映的发展上。据悉，张楠会继续向梁汝波汇报。
 
        随后，字节跳动 CEO 梁汝波发布内部信，宣布了这一高管调整。梁汝波在内部信中称，结合业务发展需要和个人意愿，张楠不再担任抖音集团 CEO，专注负责剪映 CapCut 业务。
         
        张楠在个人朋友圈中表示，2024 年是她加入公司的第十年，「有很多很多收获也有些许遗憾」，「人生要拿得起放得下」，「只有真正的放下了，才能全力以赴的出发」，她希望在下一个十年再折腾一些热爱的事情，跟着这个 AI 时代一起成长。
         
        结合 1 月 30 日上字节跳动 2024 年年度全员会上，梁汝波在分享中谈到的，字节跳动 2024 年的关键词是「始终创业，逃逸平庸的重力」，张楠此后聚焦在剪映的发展，或许也可以理解为一次「内部创业」。这不是梁汝波第一次对内部谈到公司的「大公司病」，以及强调「始终创业」的重要性，此前在字节跳动成立 10 年之际，梁汝波就曾在内部信中表示，组织渐渐变大之后，负规模效应也在变大，要避免过于依赖资源，陷入「大公司病」，并将「字节范」中的「始终创业」从第五提升至第一位。
         
        在加入字节跳动之前，张楠创业做图片社区 App，之后公司被字节跳动收购。2014 年，张楠带领团队加入，开始负责字节跳动的 UGC 业务。2016 年她带领团队，从 0 到 1 推出了抖音等产品。2018、2019年，张楠牵头字节跳动的相机业务，带领团队研发出轻颜、剪映等新产品。2020年，张楠出任抖音集团 CEO。
         
        接近剪映的人士向极客公园透露，过去一年，张楠已经把绝大多数精力倾斜到剪映相关业务上，并亲自带队寻求在 AI 辅助创作上有所突破，即将推出一个 AI 生图和视频的产品。公开信息显示，截至 2021 年，剪映的月活用户已经突破 1 亿。
         
        据接近抖音集团人士表示，随着各项业务趋近成熟，张楠辞任后，公司没有新设 CEO 的计划。接下来，集团业务将由抖音负责人韩尚佑、番茄小说及今日头条负责人张超、抖音电商负责人魏雯雯、抖音生活服务负责人浦燕子以及抖音广告业务负责人赵修影分别负责。韩尚佑作为抖音总裁，会协同所有与抖音相关的主营业务。`,
      },
      {
        id: 19,
        name: "当大模型公司都在卷大参数，面壁智能却在尽可能把参数做小",
        classify: "通知公告",
        content:`在通往 AGI 的路上，绝大多数公司的路线是不断做大参数，但面壁智能却走了一条相反的路线——尽可能把模型参数做小。

        2 月 1 日，面壁智能推出了只有 2B（注：20 亿）参数量级的模型 MiniCPM，而其性能却超过了大参数模型 Mistral-7B（法国大模型公司 Mistral 旗下知名模型）、且部分超越 Llama-13B（Meta 旗下知名开源大模型）等，内部称之为「以小博大」。
        
        这个结果揭露了这样一个事实：很多超大参数的大模型，它们的模型效率或许并没有最大化。
        
        「我们希望探索模型性能的天花板。」面壁智能联合创始人刘知远教授称。他认为，从技术研判而言，2023 年 ChatGPT 和 GPT-4 的推出，表明大模型技术路线已经基本确定，接下来就是要探索其科学机理，并极致地优化效率。
        
        他表示，在 Mistral-6B 的同一模型水平下，面壁智能团队的模型参数量是最小的。这或许意味着模型的效率被提升到了最高水平。「我觉得我们做了一件挺牛的事。」他笑着说。`,
      },
      {
        id: 20,
        name: "欧盟反垄断「撬开」苹果，结果坑苦了开发者",
        classify: "通知公告",
        content:`iPhone 只能通过 App Store 装应用的历史，即将终结。

        美国当地时间 1 月 25 日，苹果宣布，将在欧盟地区打破 App Store 的「垄断」现状，允许其他企业在 iOS 系统上建立第三方应用商店。未来，开发者将可以自主选择将应用上架到任意商店，以规避苹果 App Store 的 30% 佣金抽成，应用内消费也不必再走苹果的支付渠道。
        
        这项改变是为了配合欧盟出台的，即将于 3 月生效的《数字市场法案》（Digital Market Act，简称 DMA）。这项法案出台的初衷，是为了阻止科技巨头利用自己的「守门人」身份，获得不正当的竞争优势。
        
        毫无疑问，DMA 最大的监管目标就是苹果 App Store。自 2008 年上线至今，苹果一手将 iOS 和 App Store 缔造成了科技界最繁荣茂盛的「封闭花园」。通过软件服务，苹果一年可以获得 781 亿美元收入，约占苹果总收入的五分之一。因为「苹果税」的存在，不少开发者都与苹果产生了摩擦，甚至升级为公开对抗。
        
        苹果为配合 DMA 的新规公布后，不少人发现，新规虽然允许第三方应用商店存在，却依然设置了不低的准入门槛，并增设了一项「核心技术使用费」。对此，有反对者表示，苹果的新规保证了开发者很难从中获得任何实惠，App Store「事实性垄断」的现状不会因此改变。
        
        这场苹果、开发者与监管部门三方之间的「战争」，才刚刚打响了第一枪。`,
      },
      {
        id: 21,
        name: "奈飞已经找到了视频平台的「解药」",
        classify: "技术热点",
        content:`2023 年是奈飞过去十年中最成功的一年，近日发布的财报再次证实了这一点。

 

        奈飞在 23 日美股盘后发布了截至 2023 年 12 月 30 日的第四季度财报，奈飞在财报中宣称，公司已经证明了流媒体业务可以成为一项 「非常健康的业务」。随着罢工的结束，原本拒绝向奈飞授权内容的竞争对手们纷纷改变了策略，开始寻求合作。
        
         
        
        财报显示，奈飞四季度报告期内实现营收 88.33 亿美元，同比增长 12.5%，高于此前预期的 86.92 亿美元；净利润 9.38 亿美元，调整后每股收益为 2.11 美元。奈飞预计，将在 2024 年第一季度实现营收 92.40 亿美元，同比增长 13.2%；每股收益为 4.49 美元，高于市场预期的 4.10 美元。
        
         
        
        第四季度，奈飞注册用户数量大幅增长，当季新增订阅用户超过 1310 万，远超华尔街 870 万的预期。分区域来看，奈飞第四季度在美国新增了 120 万付费用户，最强劲的用户增长则主要来自欧洲和亚洲的国际市场。截至 2023 年底，奈飞在全球共有创纪录的 2.6028 亿会员。
        
         
        
        寒冬之后，奈飞不仅成功恢复了用户和利润的增长，更是在全球范围内实现了付费用户数量的大幅跃升，达到了新的里程碑。而翻盘的奈飞，过去一年里主要靠三个因素：
        
         
        
        用户层面，推出低价的带广告版订阅，并对原有的订阅服务提价。
        内容层面，改善与传统娱乐巨头的关系，加大了内容采购的占比。
        外力上，AI 兴起造成的好莱坞编剧罢工，让传统娱乐巨头自顾不暇，间接帮助了奈飞。
         
        
        在公布高于预期的2023年四季度及全年业绩后，奈飞的股价在盘后交易中上涨超过 8%。到目前为止，奈飞仍然是唯一盈利的主要流媒体服务商，与一年前相比，奈飞的股价上涨了 36%，而迪士尼的股价下跌了 10%，华纳兄弟 Discovery 的股价则同期下跌了 22%。作为好莱坞的后起之秀，奈飞在流媒体大战里已经露出了赢面。
        
         
        
        对奈飞而言，更重要的是：随着与传统娱乐巨头的和解破冰，加上稳固了自己的用户优势，逐渐逃出过去几年高投入、低增长的恶性泥潭，腾出手的奈飞有了更多精力和财力扩张业务，不论是尝试游戏研发，还是内容层面向综艺、体育发力。
        
         
        
        历史的经验证明：每一次战争都会给参战方带来巨大消耗。但只要赢到最后，消化胜利的果实，赢家也会迎来更好的发展机遇。`,
      },
      {
        id: 22,
        name: "这款自动化工具，让广告投放从「玄学」变成「科学」",
        classify: "技术热点",
        content:`巨量引擎是国内头部广告投放平台，企业在这里花钱投入，希望把产品推向更多用户、获得更多销售收入——但这一直是一个相当复杂、繁琐的工作，企业往往需要一支庞大的广告投放团队做支持。
        依赖人力的问题不止是要花钱雇人这么简单：人的投放经验很难总结和复制，有人甚至戏称这是一门「玄学」；人无法 24 小时盯盘，可能错失流量机会；人的操作可能会犯错，带来很大损失……在巨量引擎产品运营中台负责人于粟天看来，投放人力成本攀升、投入产出比不满意等，一直是企业普遍面临的难题。
        而科技提供了可能的解法。1 月 23 日，在经过大半年探索后，巨量引擎正式推出了自动化投放产品 UBMax——通过最新的大模型技术、海量的数据训练，UBMax 将顶尖广告投手们的经验凝结其中，让广告投放工作实现了自动化——它能够让企业以更稳定的成本进行广告投放，并获得更高的收入回报。
        目前，UBMax 主要覆盖线索留资（吸引销售线索）、app 下载、引流电商（电商卖货）三大营销场景。
        星苒科技是专注大健康赛道的广告代理，公司过去一年在巨量引擎的团队布局和广告投放占比达到了 80%。其创始人兼 CEO 王斐洋称，公司在试用 UBMax 近 3 个月后，发现其相比传统人工投放，拿量稳定提升了 30%、投放 ROI 稳定提升了 10-20%，团队成本也大大降低。
        而于粟天称，过去近半年，在线索留资场景上，近 40% 的广告消耗已经通过 UBMax 完成。
        这意味着广告投放领域正在迎来颠覆性的变革：对于投放团队来说，他们得以从重复性投放工作中解放出来，将更多精力放在广告的核心要素上——如公司对产品的理解、对用户的洞察、以及广告创意决策等方面。「无论是在巨量引擎、还是国内外的其他广告市场，用智能化帮助广告主做好决策才是明确的趋势。说白了，一些细碎的活儿系统帮着干了，那更上层的决策判断就更加关键。」于粟天说。
        而对于企业来说，当营销传播这件事能以更简单、高效的方式完成，它们就可以将更多的资金、人力放到企业的根本，即为用户提供好的产品、服务上面。这也是商业价值的回归。
        在 UBMax 的发布会上，极客公园创始人张鹏邀请了 UBMax 的三位合作伙伴——众安保险直营事业部用户增长负责人张侃、 玩心不止高级市场总监张烨楠，星苒科技创始人兼 CEO 王斐洋，以及巨量引擎产品运营中台负责人于粟天，一起展开了圆桌对话。他们聊到了 UBMax 这款产品的价值，以及它给广告营销、企业经营等方面带来的影响。`,
      },
      {
        id: 23,
        name: "互联网最「卷」的行业，开始迎来 AI 改造",
        classify: "技术热点",
        content:`AI 创业热潮汹涌。在「百模大战」卷了一年后，行业共识已经转向「卷应用」，将大模型的价值落地。
        其中电商是和大模型的结合最快最高效的场景之一，在各路电商平台比拼低价快「卷不动」了的时候，AI 的爆发让技术创新给这个行业重新带来进步。
        在一些行业还在寻找大模型落地场景时，大模型能力在电商行业正在以极快的速度进入产业链。
        近日，一家来自日本东京的创业团队 TheSEA，瞄准了电商的「内容痛点」，利用自研技术开发的 AI 生成工具，让电商内容广告制作的成本大幅下降。
        TheSEA 并不是孤例，在阿里云联合天猫举行的「Create@AI 创客松」活动中，来自各地的 22 支团队，在 48 小时时间内，通过阿里云提供的「云+AI 工具箱」和天猫生态实验室的支持，完成从 idea 到产品的跨越，快速实现产品功能的迭代与上线。
        而这些团队的目标，则是如何利用 AI 和大模型技术，真正实现 AI 在电商行业和上下游环节上的变革。
        「新 AI」改造「老电商」
        要想知道「AI+电商」目前能有哪些方向发生着创新，其实看这次大赛的赛题就够了，22 家团队都从这其中切入找到了自己的产品方向——
        To B：产品设计和开发阶段；采购和供应链管理；生产流程优化；销售和市场营销。
        
        To C：个性化客户体验；客户互动与服务。`,
      },
      {
        id: 24,
        name: "炒到 10 万元一台，苹果 Vision Pro 到底牛在哪里？",
        classify: "技术热点",
        content:`Apple Vision Pro 要上市了。

        当地时间 1 月 19 日早上 8 点，苹果在美国开启了 Apple Vision Pro 的预售。与任何苹果新品发售时的情况一样，首批产品迅速售罄。数小时后，预计发货时间已来到了 3 月中旬。
        
        有媒体报道，在国内，一些黄牛渠道已经将将价格炒到 10 万元的「天价」。VR 和 AR 从业者的朋友圈，这两天的主题就是晒订单和找谁去了美国，求届时帮忙把 Vision Pro 人肉「背」回国。
        
        伴随产品开售，新一批媒体体验报道也同步解禁。其中大多盛赞了 Apple Vision Pro 创新的技术实践，精细的体验打磨。这是一款由苹果打造的 MR 头显，代表了世界最顶尖的软硬件设计水平。
        
        但与此同时，大部分体验者也都指出，Apple Vision Pro 依然是一台 MR 头显。那些物理和技术上的各种局限，比如重量、续航，与现实疏离的不适感，并没有从根本上得到解决。
        
        Apple Vision Pro 是苹果整个公司历史上前期开发投入最大，周期最长的产品，但它的起步却注定缓慢。此前有市场机构预估，Apple Vision Pro 首年销售预期约为 30-40 万部，即便顺利完成，也只能为苹果带来 14 亿美元收入。
        
        14 亿美元对苹果来说，只相当于公司总收入的 0.4%。但去年美国 XR 硬件的市场规模总额，也只有区区 6.6 亿美元而已。
        
        苹果和 Apple Vision Pro，能再一次力挽狂澜，创造新的消费电子时代吗？`,
      },
      {
        id: 25,
        name: "被忽视 11 年的 AR 眼镜，回到了 CES 的舞台中央",
        classify: "技术热点",
        content:`今年的 CES，注定离不开两个关键词，XR 和 AI。

        就在开幕前两天，1 月 8 日，苹果宣布将于 2 月正式发售去年推出的混合现实头显产品，Apple Vision Pro。
        
        这让 XR 产品再次成为了今年 CES 的焦点，过去数年，所有人都在等待 XR 的「iPhone 时刻」。随着苹果正式入局，期待被带向一个至高点。
        
        目前 XR 市场的热度很高，资金和关注度的热潮高涨，但依然鲜有一款产品能做到「一锤定音」。从几百元的音频眼镜，到数万元的 Apple Vision Pro，厂商都还处于探索的阶段。并没有出现一款产品，像 iPhone 之于智能手机一样，定义一个明确的未来形态。
        
        市场等待的，与其说是某一个品牌的某一款产品，不如说是一个真正可用、有用、好用的产品范式。
        
        过去十年，XR 领域的焦点一直集中在 VR 头显上，AR 眼镜的技术路线，在几家大厂尝试并失败之后，一直处于被忽视的行业「背阴面」。
        
        但随着技术和市场的发展，AR 产品范式的轮廓正逐渐浮出水面，变得愈发清晰。就在今年的 CES 上，雷鸟创新展示了旗下最新一代的 AR 眼镜产品雷鸟 X2 Lite，不仅实现了双目全彩显示，还将整机重量降到了 60g 左右，几乎达到了普通墨镜的水平。`,
      },
    ]),

    knex("classification_article").insert([
      { classification_id: 1, article_id: 1 },
      { classification_id: 1, article_id: 2 },
      { classification_id: 1, article_id: 3 },
      { classification_id: 1, article_id: 4 },
      { classification_id: 1, article_id: 5 },
      { classification_id: 2, article_id: 6 },
      { classification_id: 2, article_id: 7 },
      { classification_id: 2, article_id: 8 },
      { classification_id: 2, article_id: 9 },
      { classification_id: 2, article_id: 10 },
      { classification_id: 3, article_id: 11 },
      { classification_id: 3, article_id: 12 },
      { classification_id: 3, article_id: 13 },
      { classification_id: 3, article_id: 14 },
      { classification_id: 3, article_id: 15 },
      { classification_id: 4, article_id: 16 },
      { classification_id: 4, article_id: 17 },
      { classification_id: 4, article_id: 18 },
      { classification_id: 4, article_id: 19 },
      { classification_id: 4, article_id: 20 },
      { classification_id: 1, article_id: 21 },
      { classification_id: 1, article_id: 22 },
      { classification_id: 2, article_id: 23 },
      { classification_id: 3, article_id: 24 },
      { classification_id: 4, article_id: 25 },
    ]),
  ]);
};
